app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Elsie Andiensa "], ["email", "Andiensa@gmail.com "], ["password", "111222333"], ["created_at", "2021-04-28 19:32:39.046950"], ["updated_at", "2021-04-28 19:32:39.046950"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save